# load extension

In [1]:
%reload_ext mysqlmagic

# set database configs

In [2]:
%%configs
{
    "user": "root",
    "password": "admin",
    "host": "127.0.0.1",
    "port": 3308
}

Connect to the database successfully! The database version is 5.7.36

In [3]:
%%mysql
USE PEOPLE;

0

In [4]:
%%mysql
SHOW tables;

# create table

In [5]:
%%mysql
DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee (
    PersonID int,
    FirstName varchar(255),
    LastName varchar(255),
    Age int,
    Sex varchar(255),
    Income float
);

0

# insert

In [6]:
%%mysql
INSERT INTO Employee(PersonID, FirstName, LastName, Age, Sex, Income)
VALUES (1, 'Jack', 'Ma', 50, 'M', 20000000)

1

# select

In [7]:
%%mysql -v query_results
SELECT * FROM Employee;

In [8]:
query_results

   PersonID FirstName LastName  Age Sex      Income
0         1      Jack       Ma   50   M  20000000.0

# update

In [9]:
%%mysql
UPDATE Employee
SET Income = 200000
WHERE FirstName = 'Jack' AND LastName = 'Ma';

1

In [10]:
%%mysql
SELECT * FROM Employee;

# delete

In [11]:
%%mysql
DELETE 
FROM Employee
WHERE FirstName = 'Jack' AND LastName = 'Ma';

1

In [12]:
%%mysql
SELECT * FROM Employee;

0

In [13]:
%%mysql?